#!/usr/bin/env python
# _*_ coding:utf-8 _*_
#
# @Version : 1.0
# @Time    : 2018/5/21
# @Author  : mtt

amount = 60000
Rate = [0.0178,0.0178,0.0178,0.0178,0.0178,0.018,0.018,0.018,0.018,0.0268,0.0268,0.0268,0.0268,0.02,0.02,0.02,0.02,0.02,0.0175,0.0175,0.0175,0.0175,0.0188,0.0188,0.0188,0.0228,0.0228,0.0228,0.0268,0.0268,0.0165,0.0165,0.0165,0.0165,0.0168,0.0168,0.0168,0.0198,0.0198,0.0198]
#金领贷：0.0178，薪金贷I：0.018，商易贷：0.0268，普惠新居：0.02，薪金贷II：0.0175，保单贷A：0.0188，保单贷B：0.0228，保单贷C：0.0268，新贵时代：0.0165，银信贷A：0.0168，银信贷B：0.0198
periods =[6,12,18,24,36,6,12,18,24,6,12,18,24,6,12,18,24,36,6,12,18,24,12,24,36,12,24,36,12,24,6,12,18,24,12,24,36,12,24,36]
mouthRate = 0.0106
service_rate = [0.0028,0.004,0.0045,0.006,0.0075,0.0028,0.004,0.0045,0.006,0.0028,0.004,0.0045,0.006,0.0028,0.004,0.0045,0.006,0.0075,0.0028,0.004,0.0045,0.006,0.004,0.006,0.0075,0.004,0.006,0.0075,0.004,0.006,0.0028,0.004,0.0045,0.006,0.004,0.006,0.0075,0.004,0.006,0.0075]
for i in range(len(Rate)):
    Contract_amount= (amount/periods[i] + float(amount*Rate[i]))*float((1/mouthRate))*float((1+mouthRate))**(periods[i]-1)/float((1+mouthRate))**periods[i]

#签约金额=（到手金额/期限+到手金额*费率）*（1/月利率）*[(1+月利率）^期数-1]/(1+月利率）^期数

    Monthly_payments = (Contract_amount+float(Contract_amount*service_rate[i]))*float(mouthRate)*float((1+mouthRate))**periods[i]/float((1+mouthRate))**(periods[i]-1)

#月还款金额 = （签约金额+签约金额*服务费率）*月利率*（1+月利）^期限/[（1+月利率）^期数-1]
    print(Monthly_payments)


